{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>@\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape_type": "raw", "trainable": true, "input_dtype": "float32", "output_shape": null, "name": "lambda_1", "arguments": {}, "batch_input_shape": [null, 160, 320, 3]}}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_1", "cropping": [[70, 25], [0, 0]], "batch_input_shape": [null, 160, 320, 3], "trainable": true, "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [4, 4], "nb_filter": 16, "nb_col": 8, "dim_ordering": "tf", "W_regularizer": null, "nb_row": 8, "b_regularizer": null, "border_mode": "same", "trainable": true, "name": "convolution2d_1", "activity_regularizer": null, "W_constraint": null, "bias": true, "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [2, 2], "nb_filter": 32, "nb_col": 5, "dim_ordering": "tf", "W_regularizer": null, "nb_row": 5, "b_regularizer": null, "border_mode": "same", "trainable": true, "name": "convolution2d_2", "activity_regularizer": null, "W_constraint": null, "bias": true, "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [2, 2], "nb_filter": 64, "nb_col": 5, "dim_ordering": "tf", "W_regularizer": null, "nb_row": 5, "b_regularizer": null, "border_mode": "same", "trainable": true, "name": "convolution2d_3", "activity_regularizer": null, "W_constraint": null, "bias": true, "activation": "linear", "b_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"output_dim": 512, "init": "glorot_uniform", "b_constraint": null, "bias": true, "input_dim": 6400, "W_regularizer": null, "b_regularizer": null, "trainable": true, "name": "dense_1", "activity_regularizer": null, "W_constraint": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"output_dim": 1, "init": "glorot_uniform", "b_constraint": null, "bias": true, "input_dim": 512, "W_regularizer": null, "b_regularizer": null, "trainable": true, "name": "dense_2", "activity_regularizer": null, "W_constraint": null, "activation": "linear"}}], "keras_version": "1.2.1"}